# This is a heading

This is a new notebook for my python practice

# This your heading

This is a description

In [1]:
#imports
import pandas as pd
import numpy as np

In [2]:
# create a new dictionanry
dict = {"Name": ['Njeri', 'Mucheru', 'Alex', 'Brian'],
       " Age": [17, 16, 23, 45], 
       "Salary": [23000, 45000, 32000, 60000]}

dict

{'Name': ['Njeri', 'Mucheru', 'Alex', 'Brian'],
 ' Age': [17, 16, 23, 45],
 'Salary': [23000, 45000, 32000, 60000]}

In [3]:
data = pd.DataFrame(dict)

In [4]:
data

      Name   Age  Salary
0    Njeri    17   23000
1  Mucheru    16   45000
2     Alex    23   32000
3    Brian    45   60000

In [5]:
numbers = np.random.randint(3, size=4)
numbers

array([1, 2, 1, 1])

In [6]:
data2 = pd.DataFrame(numbers)

In [7]:
data2

   0
0  1
1  2
2  1
3  1

In [8]:
var = np.random.randint(4, size=2)

In [9]:
series1 = pd.Series(var)
series1

0    2
1    1
dtype: int32